TI-Tuya-Project/tuya-os-sdk-cc35x1/network_terminal_LP_EM_CC35X1_freertos_ticlang/network_terminal.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/ti/boards/LP_EM_CC35X1" --rtos "freertos" --product "simplelink_wifi_sdk@9.21.00.15" --product "TOOLBOX@4.0.13"
 * @v2CliArgs --board "/ti/boards/LP_EM_CC35X1" --rtos "freertos" --product "simplelink_wifi_sdk@9.21.00.15" --product "TOOLBOX@4.0.13"
 * @versions {"tool":"1.26.0+4407"}
 */

/**
 * Import the modules used in this configuration.
 */
const FreeRTOS              = scripting.addModule("/freertos/FreeRTOS");
const ADC                   = scripting.addModule("/ti/drivers/ADC", {}, false);
const ADC1                  = ADC.addInstance();
const CryptoKeyKeyStore_PSA = scripting.addModule("/ti/drivers/CryptoKeyKeyStore_PSA");
const GPIO                  = scripting.addModule("/ti/drivers/GPIO");
const GPIO2                 = GPIO.addInstance();
const PWM                   = scripting.addModule("/ti/drivers/PWM", {}, false);
const PWM1                  = PWM.addInstance();
const Power                 = scripting.addModule("/ti/drivers/Power");
const SPI                   = scripting.addModule("/ti/drivers/SPI", {}, false);
const SPI1                  = SPI.addInstance();
const TRNG                  = scripting.addModule("/ti/drivers/TRNG", {}, false);
const TRNG1                 = TRNG.addInstance();
const UART2                 = scripting.addModule("/ti/drivers/UART2");
const UART21                = UART2.addInstance();
const UART22                = UART2.addInstance();
const Settings              = scripting.addModule("/ti/posix/freertos/Settings");

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.useTimeSlicing = true;
FreeRTOS.heapSize       = 0x00051000;

ADC1.$name = "CONFIG_ADC_0";

GPIO2.$hardware = system.deviceData.board.components.LED_RED;
GPIO2.$name     = "CONFIG_GPIO_LED_0";

PWM1.$name             = "CONFIG_PWM_0";
PWM1.timerObject.$name = "CONFIG_GPTIMER_0";

SPI1.$name = "CONFIG_SPI_0";

TRNG1.$name = "CONFIG_TRNG_0";

UART21.$name                     = "CONFIG_UART2_0";
UART21.$hardware                 = system.deviceData.board.components.XDS110UART;
UART21.uart.dmaTxChannel.$assign = "DMA_CH2";
UART21.uart.dmaRxChannel.$assign = "DMA_CH3";

UART22.$name = "CONFIG_UART2_1";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
ADC1.adcChannel.adc.$suggestSolution        = "ADC0";
ADC1.adcChannel.adc.adcPin.$suggestSolution = "boosterpack.26";
GPIO2.gpioPin.$suggestSolution              = "boosterpack.31";
PWM1.timerObject.timer.$suggestSolution     = "GPT0";
SPI1.spi.$suggestSolution                   = "SPI0";
SPI1.spi.sclkPin.$suggestSolution           = "boosterpack.4";
SPI1.spi.dmaRxChannel.$suggestSolution      = "DMA_CH11";
SPI1.spi.dmaTxChannel.$suggestSolution      = "DMA_CH10";
SPI1.spi.pociPin.$suggestSolution           = "boosterpack.3";
SPI1.spi.picoPin.$suggestSolution           = "boosterpack.38";
UART21.uart.$suggestSolution                = "UART1";
UART21.uart.txPin.$suggestSolution          = "GPIO5";
UART21.uart.rxPin.$suggestSolution          = "GPIO6";
UART22.uart.$suggestSolution                = "UART2";
UART22.uart.dmaTxChannel.$suggestSolution   = "DMA_CH1";
UART22.uart.dmaRxChannel.$suggestSolution   = "DMA_CH0";
UART22.uart.txPin.$suggestSolution          = "boosterpack.37";
UART22.uart.rxPin.$suggestSolution          = "boosterpack.25";
